app/views/fowls/show.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."fowl_id" = 7
SELECT "comments".* FROM "comments" WHERE "comments"."fowl_id" = 7
---
						#comment
							%h2.comment_count= pluralize(@fowl.comments.count, "Comment")
							- @fowl.comments.each do |comment|
								.comment