app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "fowl_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "This is my first comment.."], ["created_at", Thu, 17 Sep 2015 06:21:17 UTC +00:00], ["fowl_id", 7], ["updated_at", Thu, 17 Sep 2015 06:21:17 UTC +00:00], ["user_id", 2]]
SELECT "fowls".* FROM "fowls" WHERE "fowls"."id" = ? LIMIT 1  [["id", "7"]]
---
  def create
		@comment = Comment.new(comment_params)

		if @comment.save
			redirect_to fowl_path(@fowl)
		else
			render 'new'
		end
  end

	private

	def	comment_params
		{
			user_id: current_user.id,
			content: params[:comment][:content],
			fowl_id: @fowl.id
		}
	end

	def	get_fowl
		@fowl = Fowl.find(params[:fowl_id])