app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`created_at`, `email`, `updated_at`) VALUES ('2015-10-22 13:20:07', 'test@yahoo.com', '2015-10-22 13:20:07')