app/controllers/fowls_controller.rb

SELECT "fowls".* FROM "fowls" WHERE "fowls"."id" = ? LIMIT 1  [["id", "4"]]
---
	end

	def	find_fowl
		@fowl = Fowl.find(params[:id])